// ==========================================================================================
// Функції для виконання HTTP-запитів
// ==========================================================================================
// ------------------------------------------------------------------------------------------
// fetchNotes : має виконувати запит для отримання колекції нотаток із сервера.
// Повинна підтримувати пагінацію (через параметр сторінки) та фільтрацію за ключовим словом (пошук);
// ------------------------------------------------------------------------------------------
// createNote: має виконувати запит для створення нової нотатки на сервері.
// Приймає вміст нової нотатки та повертає створену нотатку у відповіді;
// ------------------------------------------------------------------------------------------
// deleteNote: має виконувати запит для видалення нотатки за заданим ідентифікатором.
// Приймає ID нотатки та повертає інформацію про видалену нотатку у відповіді.
// ------------------------------------------------------------------------------------------

// Імпорт бібліотеки axios
import axios from 'axios';

// Імпорт інтерфейса для одного фільму
import { type Note } from '../types/note';

// Отримуємо значення змінної оточення (з файлу .env)
// Не забуваємо додати .env в файл .gitignore !!!
// Додатково треба додати в Versel (Settings → Environment Variables)
const myKey = import.meta.env.VITE_NOTEHUB_TOKEN;
const myAuthorization = 'Bearer ' + myKey;

const BASE_URL = 'https://notehub-public.goit.study/api/notes';

// Типізація відповіді від Axios - згідно структури бекенда :
// https://notehub-public.goit.study/api/docs/#/Notes/getNote
interface NotesHttpResponse {
  notes: Note[]; // Відповідь містить масив нотаток у властивості results
  totalPages: number; // Загальна кількість сторінок результатів
}

// ==========================================================================================
// fetchNotes : має виконувати запит для отримання колекції нотаток із сервера.
// Повинна підтримувати пагінацію (через параметр сторінки) та фільтрацію за ключовим словом (пошук)
// ==========================================================================================
// Структура запиту :
// ------------------------------------------------------------------------------------------
// https://notehub-public.goit.study/api/notes?search=example_search&tag=Work&page=2&perPage=10&sortBy=updated
// ------------------------------------------------------------------------------------------
// Базовий URL
// https://notehub-public.goit.study/api/notes
// ------------------------------------------------------------------------------------------
// Search notes by title or content - Пошук нотаток по заголовку або контенту
// search=example_search
// ------------------------------------------------------------------------------------------
// Filter notes by tag - Фільтрація по тегу (не обов'язково !)
// tag=Work
// ------------------------------------------------------------------------------------------
// Page number for pagination - Номер сторінки для пагінації
// page=2
// ------------------------------------------------------------------------------------------
// Number of notes per page - Кількість нотаток на сторінці
// perPage=10
// ------------------------------------------------------------------------------------------
// Sort notes by created or updated field - Сортування за часом створення адо оновлення
// (не обов'язково !)
// sortBy=updated
// ------------------------------------------------------------------------------------------

export async function fetchNotes(
  nameSearch: string,
  pageCurrent: number = 1
): Promise<{ notes: Note[]; totalPages: number }> {
  let url = BASE_URL;
  if (nameSearch !== '') {
    url = url + `?search=${nameSearch}&page=${pageCurrent}&perPage=12`;
  } else {
    url = url + `?&page=${pageCurrent}&perPage=12`;
  }

  const options = {
    method: 'GET',
    headers: {
      accept: 'application/json',
      Authorization: myAuthorization,
    },
  };
  // Виконуємо HTTP-запит
  const response = await axios.get<NotesHttpResponse>(url, options);

  console.log('totalPages', response.data.totalPages);

  // Повертаємо значення notes та totalPages відповіді
  return {
    notes: response.data.notes,
    totalPages: response.data.totalPages,
  };
}
