// ==========================================================================================
// Компонент App - контейнер додатка
// ==========================================================================================

// ------------------------------------------------------------------------------------------

// Імпорт модуля useState - для роботи зі станом з REACT
import { useEffect, useState } from 'react';

// Імпорт бібліотеки react-hot-toast (Додатково - npm install react-hot-toast)
// toast - функція виклика повідомлення,
// Toaster - компонент для відображення повідомлень
import toast, { Toaster } from 'react-hot-toast';

// Імпорт модуля зі стилями компонента
import css from './App.module.css';

// Імпорт компонента SearchBox
import SearchBox from '../SearchBox/SearchBox';

// Імпорт компонента NoteList
import NoteList from '../NoteList/NoteList';

// Імпорт компонента Pagination
import Pagination from '../Pagination/Pagination';

// Імпорт компонента ErrorMessage
import ErrorMessage from '../ErrorMessage/ErrorMessage';

// Імпорт компонента Loader
import Loader from '../Loader/Loader';

// Імпорт компонента Modal
import Modal from '../Modal/Modal';

// Імпорт компонента
import NoteForm from '../NoteForm/NoteForm';

// Імпорт інтерфейсів для однієї нотатки та для створення нової нотатки
import type { NoteShort } from '../../types/note';

// Iмпорт функції для HTTP-запроса
import { fetchNotes, deleteNote, createNote } from '../../services/noteService';

// Імпорт хук useQuery, який виконує асинхронні запити та автоматично керує станами завантаження,
// помилок та збереженням даних, значно спрощуючи роботу з API.
import { useQuery } from '@tanstack/react-query';

// Імпорт хук useMutation
// Мутації в React Query використовуються для виконання операцій, які змінюють дані на сервері,
// таких як створення, оновлення або видалення записів.
import { useMutation } from '@tanstack/react-query';

// Імпортуємо хук useQueryClient
import { useQueryClient } from '@tanstack/react-query';

// Імпорт keepPreviousData - для збереження попереднього запиту, поки не прийдуть нові дані
import { keepPreviousData } from '@tanstack/react-query';

// Імпорт хук useDebouncedCallback(callback, delay) з бібліотеки use-debounce.
// Він дозволяє створити "відкладену" версію функції — тобто таку, яка не викликається
// одразу при кожному вводі символа, а лише через певний час після останньої дії.
import { useDebouncedCallback } from 'use-debounce';

export default function App() {
  // ---------------------------------------------------------------------------------------------
  // Потрібно інвалідувати кеш для конкретного queryKey, це змусить React Query
  // зробити повторний запит за колекцією даних, тобто виконати відповідний useQuery.
  // Отримуємо посилання на квері-клієнт що створювали у main.tsx
  const queryClient = useQueryClient();
  // ---------------------------------------------------------------------------------------------
  // Оголошуємо і типизуємо стан - рядок з пошуком
  // Отримуємо з localStorage збережений рядок запиту,
  // а якщо його немає, то встановлюємо початкове значення як порожній рядок
  const [query, setQuery] = useState<string>(() => {
    const savedQuery = localStorage.getItem('query');
    return savedQuery ? JSON.parse(savedQuery) : '';
  });
  // Оголошуємо і типизуємо стан - загальна кількість сторінок
  const [totalPages, setTotalPages] = useState<number>(1);
  // Оголошуємо і типизуємо стан - номер поточної сторінки
  const [page, setPage] = useState<number>(1);
  // Оголошуємо і типизуємо стан - чи відкрите модальне вікно
  const [isModalOpen, setIsModalOpen] = useState<boolean>(false);
  // ---------------------------------------------------------------------------------------------

  // --------------------------------------------------------------------------------------------
  // хук useQuery повертає об’єкт з корисною інформацією про запит :
  //    data – дані, які були успішно отримані в результаті запиту.
  //    error – якщо запит завершився помилкою, ця властивість містить інформацію про помилку.
  //    isLoading – якщо запит ще виконується, значення буде true.
  //    isError – якщо запит не вдалося виконати (наприклад, через мережеві помилки), значення буде true.
  //    isSuccess – якщо запит успішно виконався і дані отримано, значення буде true.
  const {
    data: dataNotes,
    isLoading,
    isError,
  } = useQuery({
    // ключ запиту - масив, який унікально ідентифікує запит і його параметри, що дозволяє React Query ефективно кешувати та повторно використовувати дані для однакових запитів.
    queryKey: ['notes', query, page],

    // функція запиту - асинхронна функція, яка виконує HTTP-запит і повертає дані.
    queryFn: async () => {
      // Виконуємо запит за допомогою функції fetchMovies, передаючи рядок запиту та номер сторінки,
      // і отримуємо масив фільмів та загальну кількість сторінок
      const { notes, totalPages } = await fetchNotes(query, page);
      // Записуємо стан - загальна кількість сторінок
      setTotalPages(totalPages);
      // Повертаємо в data масив нотаток
      return notes;
    },

    // властивість яка дозволяє виконувати запит лише тоді, коли рядок запиту не порожній,
    // що запобігає виконанню запиту при початковому завантаженні компонента
    // або коли користувач не ввів нічого в рядок пошуку.
    // Відключена, бо хочу рендерити при пустому пошуку
    // enabled: query !== '',

    // властивість яка дозволяє на час завантаження нових даних показувати попередні або тимчасові дані,
    // щоб уникнути порожнього стану або мерехтіння інтерфейсу під час очікування відповіді від сервера.
    placeholderData: keepPreviousData,
  });
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Використовуємо useEffect для відстеження змін в даних
  // та виклику toast-повідомлення, якщо масив нотаток порожній
  useEffect(() => {
    // Якщо в результаті запиту масив нотаток порожній, виводимо повідомлення:
    if (dataNotes && dataNotes.length === 0) {
      toast.error('No notes found for your request');
    }
  }, [dataNotes]);
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // const mutation = useMutation(options)
  // Хук useMutation приймає об’єкт налаштувань
  //   mutationFn – асинхронна функція, яка виконує запит для зміни даних на сервері,
  //                тобто POST, DELETE, PUT або PATCH.
  //   onSuccess  – викликається, коли мутація успішна. Це дозволяє вам виконати додаткові дії
  //                після того, як сервер успішно обробить запит.
  //   onError    – викликається, коли мутація завершується помилкою. Це дозволяє вам
  //                обробити помилки, наприклад, відобразити повідомлення про помилку.
  // Хук useMutation не викликає асинхронну функцію,
  // а повертає об’єкт мутації із наступними властивостями:
  //      mutate    – метод, який викликається для запуску асинхронної функції.
  //      isPending – статус, який показує, що мутація зараз виконується
  //                  (наприклад, дані відправляються на сервер).
  //      isError   – встановлюється в true, якщо сталася помилка при виконанні мутації.
  //      isSuccess – встановлюється в true, якщо мутація була успішною, і дані були оновлені на сервері.
  // Ці стани допомагають вам відстежувати, на якому етапі виконання знаходиться мутація
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Mутація для додавання нової нотатки
  const mutationCreateNote = useMutation({
    mutationFn: async (note: NoteShort) => {
      // HTTP-request
      const { noteNew } = await createNote(note);
      console.log('noteNew', noteNew);
    },
    onSuccess: () => {
      // Mutation success!
      console.log('Create success !');
      console.log('query', query);
      // Коли мутація успішно виконується, інвалідовуємо всі запити з ключем "notes",
      // що змусить React Query повторно виконати ці запити і отримати оновлені дані з сервера.
      queryClient.invalidateQueries({ queryKey: ['notes', query, 1] });
    },
    onError: error => {
      // An error happened!
      console.error('Create ERROR !', error);
    },
  });
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Mутація для видалення нотатки
  const mutationDeleteNote = useMutation({
    mutationFn: async (noteId: string) => {
      // HTTP-request
      const noteDelete = await deleteNote(noteId);
      console.log('noteDelete', noteDelete);
    },
    onSuccess: () => {
      // Mutation success!
      console.log('Delete success !');
      console.log('query', query);
      // Коли мутація успішно виконується, інвалідовуємо всі запити з ключем "notes",
      // що змусить React Query повторно виконати ці запити і отримати оновлені дані з сервера.
      queryClient.invalidateQueries({ queryKey: ['notes', query, 1] });
    },
    onError: error => {
      // An error happened!
      console.error('Delete ERROR !', error);
    },
  });
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Використовуємо useEffect для відстеження змін в даних
  useEffect(() => {
    // Зберігаємо рядок запиту в localStorage при кожній його зміні
    localStorage.setItem('query', JSON.stringify(query));
  }, [query]);
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Функції зміни стану модального вікна (відкриття/закриття)
  // const openModal = () => {
  //   // Стан - модальне вікно
  //   setIsModalOpen(true);
  // };

  const closeModal = () => {
    // Стан - модальне вікно
    setIsModalOpen(false);
  };
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Функція зміни стану рядка запиту - отримує значення строки запиту і записує його в стан :
  // Виконана з затримкою (1000 мс) за допомогою useDebouncedCallback
  const handleSearch = useDebouncedCallback((text: string) => {
    // Скидаємо номер сторінки на 1 при новому пошуку
    setPage(1);
    // Змінюємо стан - на значення строки запиту
    setQuery(text);
  }, 1000);
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Функція додавання нотатки
  // const taskCreate = (note: Note) => {
  const taskCreate = () => {
    console.log('taskCreate - note');
    const createNote: NoteShort = {
      title: 'Sample Note',
      content: 'This is a sample note content.',
      tag: 'Todo',
    };
    console.log('createNote', createNote);
    // Виклик мутації з додавання нотатки
    mutationCreateNote.mutate(createNote);
  };
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Функція видалення нотатки
  const taskDelete = (noteId: string) => {
    console.log('taskDelete - noteId', noteId);
    // Виклик мутації з видалення вибраної нотатки
    mutationDeleteNote.mutate(noteId);
  };
  // ---------------------------------------------------------------------------------------------

  return (
    <div className={css.app}>
      <header className={css.toolbar}>
        {/* Компонент SearchBox */}
        <SearchBox onChangeText={handleSearch} />
        {/* Пагінація */}
        {/* Умовний рендеринг компонента Pagination в залежності від кількості сторінок */}
        {totalPages > 1 && (
          <Pagination totalPages={totalPages} setPage={setPage} page={page} />
        )}
        {/* Кнопка створення нотатки */}
        {/* <button className={css.button} onClick={openModal}> */}
        <button className={css.button} onClick={taskCreate}>
          Create note +
        </button>
      </header>
      {/* Умовний рендеринг компонента NoteList в залежності від кількості нотаток */}
      {dataNotes && dataNotes.length > 0 && (
        <NoteList notes={dataNotes} onDelete={taskDelete} />
      )}
      <Toaster />
      {/* Умовний рендеринг компонента ErrorMessage в залежності від стану */}
      {isError && <ErrorMessage />}
      {/* Умовний рендеринг компонента Loader в залежності від стану */}
      {isLoading && <Loader />}
      {isModalOpen && (
        <Modal onClose={closeModal}>
          <NoteForm />
        </Modal>
      )}
    </div>
  );
}
